RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/inc/bl808_usb.h
/**
  ******************************************************************************
  * @file    bl808_usb.h
  * @version V1.0
  * @date
  * @brief   This file is the standard driver header file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __BL808_USB_H__
#define __BL808_USB_H__

#include "usb_reg.h"
#include "bl808_common.h"

/** @addtogroup  BL808_Peripheral_Driver
 *  @{
 */

/** @addtogroup  USB
 *  @{
 */

/** @defgroup  USB_Public_Types
 *  @{
 */

/**
 *  @brief USB LPM response type definition
 */
typedef enum {
    USB_LPM_RESP_NYET = 0, /*!< response LPM with NYET */
    USB_LPM_RESP_ACK = 1,  /*!< response LPM with ACK */
} USB_LPM_RESP_Type;

/**
 *  @brief USB LPM configuration structure type definition
 */
typedef struct
{
    uint8_t lpmEn;          /*!< response LPM or not */
    USB_LPM_RESP_Type resp; /*!< response LPM with ACK or NAK */
    uint8_t minBesl;        /*!< BESL min value */
    uint8_t maxBesl;        /*!< BESL max value */
    uint8_t lpmWakeUpEn;    /*!< LPM wakeup enable */
} USB_LPM_Cfg_Type;

/**
 *  @brief USB global interrupt type definition
 */
typedef enum {
    USB_GLOBAL_INT_DEV = 0, /*!< USB device interrupt type */
    USB_GLOBAL_INT_OTG = 1, /*!< USB OTG interrupt type */
    USB_GLOBAL_INT_HC = 2,  /*!< USB host interrupt type */
} USB_GLOBAL_INT_Type;

/**
 *  @brief USB global interrupt type definition
 */
typedef enum {
    USB_DEVICE_SPEED_FULL_SPEED = 0, /*!< USB device interrupt type */
    USB_DEVICE_SPEED_HIGH_SPEED = 1, /*!< USB OTG interrupt type */
} USB_DEVICE_SPEED_Type;

/**
 *  @brief USB normal configuration structure type definition
 */
typedef struct
{
    uint8_t forceFullSpeed; /*!< force device to full speed */
    uint8_t chipEn;         /*!< chip enable */
    uint8_t swRst;          /*!< software reset */
    uint8_t remoteWakeupEn; /*!< remote wakeup capability enable */
    uint32_t rstTimeOut;    /*!< software reset timeout count */
} USB_NORMAL_Cfg_Type;

/**
 *  @brief USB FIFO empty type definition
 */
typedef enum {
    USB_FIFO_EMPTY_FIFO_0 = 8,  /*!< USB FIFO 0 empty type */
    USB_FIFO_EMPTY_FIFO_1 = 9,  /*!< USB FIFO 1 empty type */
    USB_FIFO_EMPTY_FIFO_2 = 10, /*!< USB FIFO 2 empty type */
    USB_FIFO_EMPTY_FIFO_3 = 11, /*!< USB FIFO 3 empty type */
} USB_FIFO_EMPTY_Type;

/**
 *  @brief USB endpoint ID type definition
 */
typedef enum {
    USB_Endpoint_0 = 0, /*!< USB endpoint ID 0 */
    USB_Endpoint_1 = 1, /*!< USB endpoint ID 1 */
    USB_Endpoint_2 = 2, /*!< USB endpoint ID 2 */
    USB_Endpoint_3 = 3, /*!< USB endpoint ID 3 */
    USB_Endpoint_4 = 4, /*!< USB endpoint ID 4 */
    USB_Endpoint_5 = 5, /*!< USB endpoint ID 5 */
    USB_Endpoint_6 = 6, /*!< USB endpoint ID 6 */
    USB_Endpoint_7 = 7, /*!< USB endpoint ID 7 */
    USB_Endpoint_8 = 8, /*!< USB endpoint ID 8 */
} USB_Endpoint_Type;

/**
 *  @brief USB FIFO ID type definition
 */
typedef enum {
    USB_FIFO_0 = 0, /*!< USB endpoint ID 0 */
    USB_FIFO_1 = 1, /*!< USB endpoint ID 1 */
    USB_FIFO_2 = 2, /*!< USB endpoint ID 2 */
    USB_FIFO_3 = 3, /*!< USB endpoint ID 3 */
} USB_FIFO_Type;

/**
 *  @brief USB FIFO direction type definition
 */
typedef enum {
    USB_FIFO_DIR_OUT = 0, /*!< USB FIFO direction out */
    USB_FIFO_DIR_IN = 1,  /*!< USB FIFO direction in */
    USB_FIFO_DIR_BID = 2, /*!< USB FIFO direction bidirectional */
} USB_FIFO_DIR_Type;

/**
 *  @brief USB FIFO block max size type definition
 */
typedef enum {
    USB_FIFO_BLOCK_MAX_SIZE_512 = 0,  /*!< USB FIFO block max packet size 512 */
    USB_FIFO_BLOCK_MAX_SIZE_1024 = 1, /*!< USB FIFO block max packet size 1024 */
} USB_FIFO_BLOCK_MAX_SIZE_Type;

/**
 *  @brief USB FIFO block count type definition
 */
typedef enum {
    USB_FIFO_BLOCK_CNT_SINGLE_BLOCK = 0,  /*!< USB FIFO single block */
    USB_FIFO_BLOCK_CNT_DOUBLE_BLOCKS = 1, /*!< USB FIFO double block */
    USB_FIFO_BLOCK_CNT_TRIPLE_BLOCKS = 2, /*!< USB FIFO triple block */
} USB_FIFO_BLOCK_CNT_Type;

/**
 *  @brief USB FIFO transfer type definition
 */
typedef enum {
    USB_FIFO_TRANSFER_RSV = 0,  /*!< USB FIFO transfer type is reserved */
    USB_FIFO_TRANSFER_ISO = 1,  /*!< USB FIFO transfer type is isochronous */
    USB_FIFO_TRANSFER_BULK = 2, /*!< USB FIFO transfer type is bulk */
    USB_FIFO_TRANSFER_INT = 3,  /*!< USB FIFO transfer type is interrupt */
} USB_FIFO_TRANSFER_Type;

/**
 *  @brief USB FIFO configuration structure type definition
 */
typedef struct
{
    uint8_t enable;                         /*!< FIFO enable or disable */
    USB_FIFO_DIR_Type dir;                  /*!< FIFO direction */
    USB_Endpoint_Type epID;                 /*!< Endpoint number of FIFO */
    USB_FIFO_BLOCK_MAX_SIZE_Type blockSize; /*!< FIFO block max size */
    USB_FIFO_BLOCK_CNT_Type blockType;      /*!< FIFO block type */
    USB_FIFO_TRANSFER_Type fifoType;        /*!< FIFO transfer type */
} USB_FIFO_Cfg_Type;

/**
 *  @brief USB DMA target FIFO type definition
 */
typedef enum {
    USB_DMA_TARGET_FIFO_CTRL = 0, /*!< USB DMA target FIFO is control FIFO */
    USB_DMA_TARGET_FIFO_0 = 1,    /*!< USB DMA target FIFO is FIFO 0 */
    USB_DMA_TARGET_FIFO_1 = 2,    /*!< USB DMA target FIFO is FIFO 1 */
    USB_DMA_TARGET_FIFO_2 = 3,    /*!< USB DMA target FIFO is FIFO 2 */
    USB_DMA_TARGET_FIFO_3 = 4,    /*!< USB DMA target FIFO is FIFO 3 */
} USB_DMA_TARGET_FIFO_Type;

/**
 *  @brief USB DMA transfer type definition
 */
typedef enum {
    USB_DMA_TRANS_DIR_FIFO_2_MEM = 0,  /*!< USB DMA transfer type is FIFO to memory */
    USB_DMA_TRANS_DIR_MEM_2_FIFO = 1,  /*!< USB DMA transfer type is memory to FIFO */
    USB_DMA_TRANS_DIR_FIFO_2_FIFO = 2, /*!< USB DMA transfer type is FIFO to FIFO */
} USB_DMA_TRANS_DIR_Type;

/**
 *  @brief USB DMA configuration structure type definition
 */
typedef struct
{
    USB_DMA_TRANS_DIR_Type dir; /*!< USB DMA transfer direction */
    uint32_t memAddr;           /*!< USB DMA target memory address */
    uint32_t length;            /*!< USB DMA transfer length */
} USB_DMA_Cfg_Type;

/**
 *  @brief USB Virtual DMA target FIFO type definition
 */
typedef enum {
    USB_VDMA_TARGET_FIFO_CTRL = 0, /*!< USB VDMA target FIFO is control FIFO */
    USB_VDMA_TARGET_FIFO_0 = 1,    /*!< USB VDMA target FIFO is FIFO 0 */
    USB_VDMA_TARGET_FIFO_1 = 2,    /*!< USB VDMA target FIFO is FIFO 1 */
    USB_VDMA_TARGET_FIFO_2 = 3,    /*!< USB VDMA target FIFO is FIFO 2 */
    USB_VDMA_TARGET_FIFO_3 = 4,    /*!< USB VDMA target FIFO is FIFO 3 */
} USB_VDMA_TARGET_FIFO_Type;

/**
 *  @brief USB Virtual DMA transfer type definition
 */
typedef enum {
    USB_VDMA_TRANS_DIR_FIFO_2_MEM = 0,  /*!< USB VDMA transfer type is FIFO to memory */
    USB_VDMA_TRANS_DIR_MEM_2_FIFO = 1,  /*!< USB VDMA transfer type is memory to FIFO */
    USB_VDMA_TRANS_DIR_FIFO_2_FIFO = 2, /*!< USB VDMA transfer type is FIFO to FIFO */
} USB_VDMA_TRANS_DIR_Type;

/**
 *  @brief USB Virtual DMA configuration structure type definition
 */
typedef struct
{
    USB_VDMA_TRANS_DIR_Type dir; /*!< USB VDMA transfer direction */
    uint32_t memAddr;            /*!< USB VDMA target memory address */
    uint32_t length;             /*!< USB VDMA transfer length */
} USB_VDMA_Cfg_Type;

/**
 *  @brief USB interrupt group type definition
 */
typedef enum {
    USB_GRP_INT_G0 = 0, /*!< USB group 0 interrupt type */
    USB_GRP_INT_G1 = 1, /*!< USB group 1 interrupt type */
    USB_GRP_INT_G2 = 2, /*!< USB group 2 interrupt type */
    USB_GRP_INT_G3 = 3, /*!< USB group 3 interrupt type */
    USB_GRP_INT_G4 = 4, /*!< USB group 4 interrupt type */
} USB_GRP_INT_Type;

/**
 *  @brief USB interrupt group0 type definition
 */
typedef enum {
    USB_SUB_GRP0_INT_CX_SETUP = 0,        /*!< group0 endpoint 0 setup data received */
    USB_SUB_GRP0_INT_CX_IN = 1,           /*!< group0 endpoint 0 IN */
    USB_SUB_GRP0_INT_CX_OUT = 2,          /*!< group0 endpoint 0 OUT */
    USB_SUB_GRP0_INT_CX_COMFAIL = 3,      /*!< group0 endpoint 0 COMFAIL */
    USB_SUB_GRP0_INT_CX_COMABORT = 4,     /*!< group0 endpoint 0 COMABORT */
    USB_SUB_GRP1_INT_F0_OUT = 5,          /*!< group1 OUT interrupt of FIFO 0 */
    USB_SUB_GRP1_INT_F0_SPK = 6,          /*!< group1 short packet interrupt of FIFO 0 */
    USB_SUB_GRP1_INT_F1_OUT = 7,          /*!< group1 OUT interrupt of FIFO 1 */
    USB_SUB_GRP1_INT_F1_SPK = 8,          /*!< group1 short packet interrupt of FIFO 1 */
    USB_SUB_GRP1_INT_F2_OUT = 9,          /*!< group1 OUT interrupt of FIFO 2 */
    USB_SUB_GRP1_INT_F2_SPK = 10,         /*!< group1 short packet interrupt of FIFO 2 */
    USB_SUB_GRP1_INT_F3_OUT = 11,         /*!< group1 OUT interrupt of FIFO 3 */
    USB_SUB_GRP1_INT_F3_SPK = 12,         /*!< group1 short packet interrupt of FIFO 3 */
    USB_SUB_GRP1_INT_F0_IN = 13,          /*!< group1 IN interrupt of FIFO 0 */
    USB_SUB_GRP1_INT_F1_IN = 14,          /*!< group1 IN interrupt of FIFO 1 */
    USB_SUB_GRP1_INT_F2_IN = 15,          /*!< group1 IN interrupt of FIFO 2 */
    USB_SUB_GRP1_INT_F3_IN = 16,          /*!< group1 IN interrupt of FIFO 3 */
    USB_SUB_GRP2_INT_RESET = 17,          /*!< group2 USB reset interrupt */
    USB_SUB_GRP2_INT_SUSPEND = 18,        /*!< group2 suspend interrupt */
    USB_SUB_GRP2_INT_RESUME = 19,         /*!< group2 resume interrupt */
    USB_SUB_GRP2_INT_TX0BYTE = 20,        /*!< group2 transferred zero-length data packet interrupt */
    USB_SUB_GRP2_INT_RX0BYTE = 21,        /*!< group2 received zero-length data packet interrupt */
    USB_SUB_GRP2_INT_DMA_CMPLT = 22,      /*!< group2 DMA completion interrupt */
    USB_SUB_GRP2_INT_DMA_ERROR = 23,      /*!< group2 DMA error interrupt */
    USB_SUB_GRP2_INT_IDLE = 24,           /*!< group2 dev_idle interrupt */
    USB_SUB_GRP2_INT_WAKEUP_BY_VBUS = 25, /*!< group2 dev_wakeup_byVBUS interrupt */
    USB_SUB_GRP3_INT_VDMA_CMPLT_CXF = 26, /*!< group3 Virtual DMA completion interrupt for FIFO CXF */
    USB_SUB_GRP3_INT_VDMA_CMPLT_F0 = 27,  /*!< group3 Virtual DMA completion interrupt for FIFO 0 */
    USB_SUB_GRP3_INT_VDMA_CMPLT_F1 = 28,  /*!< group3 Virtual DMA completion interrupt for FIFO 1 */
    USB_SUB_GRP3_INT_VDMA_CMPLT_F2 = 29,  /*!< group3 Virtual DMA completion interrupt for FIFO 2 */
    USB_SUB_GRP3_INT_VDMA_CMPLT_F3 = 30,  /*!< group3 Virtual DMA completion interrupt for FIFO 3 */
    USB_SUB_GRP3_INT_VDMA_ERROR_CXF = 31, /*!< group3 Virtual DMA error interrupt for FIFO CXF */
    USB_SUB_GRP3_INT_VDMA_ERROR_F0 = 32,  /*!< group3 Virtual DMA error interrupt for FIFO 0 */
    USB_SUB_GRP3_INT_VDMA_ERROR_F1 = 33,  /*!< group3 Virtual DMA error interrupt for FIFO 1 */
    USB_SUB_GRP3_INT_VDMA_ERROR_F2 = 34,  /*!< group3 Virtual DMA error interrupt for FIFO 2 */
    USB_SUB_GRP3_INT_VDMA_ERROR_F3 = 35,  /*!< group3 Virtual DMA error interrupt for FIFO 3 */
    USB_SUB_GRP4_INT_L1 = 36,             /*!< group4 L1-state-change interrupt */
} USB_SUB_GRP_INT_Type;

/*@} end of group USB_Public_Types */

/** @defgroup  USB_Public_Constants
 *  @{
 */

/** @defgroup  USB_LPM_RESP_TYPE
 *  @{
 */
#define IS_USB_LPM_RESP_TYPE(type) (((type) == USB_LPM_RESP_NYET) || \
                                    ((type) == USB_LPM_RESP_ACK))

