RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/inc/bl808_usb.h
/** @defgroup  USB_GLOBAL_INT_TYPE
 *  @{
 */
#define IS_USB_GLOBAL_INT_TYPE(type) (((type) == USB_GLOBAL_INT_DEV) || \
                                      ((type) == USB_GLOBAL_INT_OTG) || \
                                      ((type) == USB_GLOBAL_INT_HC))

/** @defgroup  USB_DEVICE_SPEED_TYPE
 *  @{
 */
#define IS_USB_DEVICE_SPEED_TYPE(type) (((type) == USB_DEVICE_SPEED_FULL_SPEED) || \
                                        ((type) == USB_DEVICE_SPEED_HIGH_SPEED))

/** @defgroup  USB_FIFO_EMPTY_TYPE
 *  @{
 */
#define IS_USB_FIFO_EMPTY_TYPE(type) (((type) == USB_FIFO_EMPTY_FIFO_0) || \
                                      ((type) == USB_FIFO_EMPTY_FIFO_1) || \
                                      ((type) == USB_FIFO_EMPTY_FIFO_2) || \
                                      ((type) == USB_FIFO_EMPTY_FIFO_3))

/** @defgroup  USB_ENDPOINT_TYPE
 *  @{
 */
#define IS_USB_ENDPOINT_TYPE(type) (((type) == USB_Endpoint_1) || \
                                    ((type) == USB_Endpoint_2) || \
                                    ((type) == USB_Endpoint_3) || \
                                    ((type) == USB_Endpoint_4) || \
                                    ((type) == USB_Endpoint_5) || \
                                    ((type) == USB_Endpoint_6) || \
                                    ((type) == USB_Endpoint_7) || \
                                    ((type) == USB_Endpoint_8))

/** @defgroup  USB_FIFO_TYPE
 *  @{
 */
#define IS_USB_FIFO_TYPE(type) (((type) == USB_FIFO_0) || \
                                ((type) == USB_FIFO_1) || \
                                ((type) == USB_FIFO_2) || \
                                ((type) == USB_FIFO_3))

/** @defgroup  USB_FIFO_DIR_TYPE
 *  @{
 */
#define IS_USB_FIFO_DIR_TYPE(type) (((type) == USB_FIFO_DIR_OUT) || \
                                    ((type) == USB_FIFO_DIR_IN) ||  \
                                    ((type) == USB_FIFO_DIR_BID))

/** @defgroup  USB_FIFO_BLOCK_MAX_SIZE_TYPE
 *  @{
 */
#define IS_USB_FIFO_BLOCK_MAX_SIZE_TYPE(type) (((type) == USB_FIFO_BLOCK_MAX_SIZE_512) || \
                                               ((type) == USB_FIFO_BLOCK_MAX_SIZE_1024))

/** @defgroup  USB_FIFO_BLOCK_CNT_TYPE
 *  @{
 */
#define IS_USB_FIFO_BLOCK_CNT_TYPE(type) (((type) == USB_FIFO_BLOCK_CNT_SINGLE_BLOCK) ||  \
                                          ((type) == USB_FIFO_BLOCK_CNT_DOUBLE_BLOCKS) || \
                                          ((type) == USB_FIFO_BLOCK_CNT_TRIPLE_BLOCKS))

/** @defgroup  USB_FIFO_TRANSFER_TYPE
 *  @{
 */
#define IS_USB_FIFO_TRANSFER_TYPE(type) (((type) == USB_FIFO_TRANSFER_RSV) ||  \
                                         ((type) == USB_FIFO_TRANSFER_ISO) ||  \
                                         ((type) == USB_FIFO_TRANSFER_BULK) || \
                                         ((type) == USB_FIFO_TRANSFER_INT))

/** @defgroup  USB_DMA_TARGET_FIFO_TYPE
 *  @{
 */
#define IS_USB_DMA_TARGET_FIFO_TYPE(type) (((type) == USB_DMA_TARGET_FIFO_0) || \
                                           ((type) == USB_DMA_TARGET_FIFO_1) || \
                                           ((type) == USB_DMA_TARGET_FIFO_2) || \
                                           ((type) == USB_DMA_TARGET_FIFO_3) || \
                                           ((type) == USB_DMA_TARGET_FIFO_CTRL))

/** @defgroup  USB_DMA_TRANS_DIR_TYPE
 *  @{
 */
#define IS_USB_DMA_TRANS_DIR_TYPE(type) (((type) == USB_DMA_TRANS_DIR_FIFO_2_MEM) || \
                                         ((type) == USB_DMA_TRANS_DIR_MEM_2_FIFO) || \
                                         ((type) == USB_DMA_TRANS_DIR_FIFO_2_FIFO))

/** @defgroup  USB_VDMA_TARGET_FIFO_TYPE
 *  @{
 */
#define IS_USB_VDMA_TARGET_FIFO_TYPE(type) (((type) == USB_VDMA_TARGET_FIFO_0) || \
                                            ((type) == USB_VDMA_TARGET_FIFO_1) || \
                                            ((type) == USB_VDMA_TARGET_FIFO_2) || \
                                            ((type) == USB_VDMA_TARGET_FIFO_3) || \
                                            ((type) == USB_VDMA_TARGET_FIFO_CTRL))

/** @defgroup  USB_VDMA_TRANS_DIR_TYPE
 *  @{
 */
#define IS_USB_VDMA_TRANS_DIR_TYPE(type) (((type) == USB_VDMA_TRANS_DIR_FIFO_2_MEM) || \
                                          ((type) == USB_VDMA_TRANS_DIR_MEM_2_FIFO) || \
                                          ((type) == USB_VDMA_TRANS_DIR_FIFO_2_FIFO))

/** @defgroup  USB_GRP_INT_TYPE
 *  @{
 */
#define IS_USB_GRP_INT_TYPE(type) (((type) == USB_GRP_INT_G0) || \
                                   ((type) == USB_GRP_INT_G1) || \
                                   ((type) == USB_GRP_INT_G2) || \
                                   ((type) == USB_GRP_INT_G3) || \
                                   ((type) == USB_GRP_INT_G4))

/** @defgroup  USB_SUB_GRP_INT_TYPE
 *  @{
 */
#define IS_USB_SUB_GRP_INT_TYPE(type) (((type) == USB_SUB_GRP0_INT_CX_SETUP) ||       \
                                       ((type) == USB_SUB_GRP0_INT_CX_IN) ||          \
                                       ((type) == USB_SUB_GRP0_INT_CX_OUT) ||         \
                                       ((type) == USB_SUB_GRP0_INT_CX_COMFAIL) ||     \
                                       ((type) == USB_SUB_GRP0_INT_CX_COMABORT) ||    \
                                       ((type) == USB_SUB_GRP1_INT_F0_OUT) ||         \
                                       ((type) == USB_SUB_GRP1_INT_F0_SPK) ||         \
                                       ((type) == USB_SUB_GRP1_INT_F1_OUT) ||         \
                                       ((type) == USB_SUB_GRP1_INT_F1_SPK) ||         \
                                       ((type) == USB_SUB_GRP1_INT_F2_OUT) ||         \
                                       ((type) == USB_SUB_GRP1_INT_F2_SPK) ||         \
                                       ((type) == USB_SUB_GRP1_INT_F3_OUT) ||         \
                                       ((type) == USB_SUB_GRP1_INT_F3_SPK) ||         \
                                       ((type) == USB_SUB_GRP1_INT_F0_IN) ||          \
                                       ((type) == USB_SUB_GRP1_INT_F1_IN) ||          \
                                       ((type) == USB_SUB_GRP1_INT_F2_IN) ||          \
                                       ((type) == USB_SUB_GRP1_INT_F3_IN) ||          \
                                       ((type) == USB_SUB_GRP2_INT_RESET) ||          \
                                       ((type) == USB_SUB_GRP2_INT_SUSPEND) ||        \
                                       ((type) == USB_SUB_GRP2_INT_RESUME) ||         \
                                       ((type) == USB_SUB_GRP2_INT_TX0BYTE) ||        \
                                       ((type) == USB_SUB_GRP2_INT_RX0BYTE) ||        \
                                       ((type) == USB_SUB_GRP2_INT_DMA_CMPLT) ||      \
                                       ((type) == USB_SUB_GRP2_INT_DMA_ERROR) ||      \
                                       ((type) == USB_SUB_GRP2_INT_IDLE) ||           \
                                       ((type) == USB_SUB_GRP2_INT_WAKEUP_BY_VBUS) || \
                                       ((type) == USB_SUB_GRP3_INT_VDMA_CMPLT_CXF) || \
                                       ((type) == USB_SUB_GRP3_INT_VDMA_CMPLT_F0) ||  \
                                       ((type) == USB_SUB_GRP3_INT_VDMA_CMPLT_F1) ||  \
                                       ((type) == USB_SUB_GRP3_INT_VDMA_CMPLT_F2) ||  \
                                       ((type) == USB_SUB_GRP3_INT_VDMA_CMPLT_F3) ||  \
                                       ((type) == USB_SUB_GRP3_INT_VDMA_ERROR_CXF) || \
                                       ((type) == USB_SUB_GRP3_INT_VDMA_ERROR_F0) ||  \
                                       ((type) == USB_SUB_GRP3_INT_VDMA_ERROR_F1) ||  \
                                       ((type) == USB_SUB_GRP3_INT_VDMA_ERROR_F2) ||  \
                                       ((type) == USB_SUB_GRP3_INT_VDMA_ERROR_F3) ||  \
                                       ((type) == USB_SUB_GRP4_INT_L1))

/*@} end of group USB_Public_Constants */

/** @defgroup  USB_Public_Macros
 *  @{
 */
#define USB_SUB_GRP0_INT_OFS              (0)
#define USB_SUB_GRP1_INT_OFS              (32)
#define USB_SUB_GRP2_INT_OFS              (64)
#define USB_SUB_GRP3_INT_OFS              (96)
#define USB_SUB_GRP4_INT_OFS              (128)
#define USB_SOF_TIMER_MASK_AFTER_RESET_HS (0x44C)
#define USB_SOF_TIMER_MASK_AFTER_RESET_FS (0x2710)

#define USB_INT_CX_SETUP       (1ULL << USB_SUB_GRP0_INT_CX_SETUP)
#define USB_INT_CX_IN          (1ULL << USB_SUB_GRP0_INT_CX_IN)
#define USB_INT_CX_OUT         (1ULL << USB_SUB_GRP0_INT_CX_OUT)
#define USB_INT_CX_COMFAIL     (1ULL << USB_SUB_GRP0_INT_CX_COMFAIL)
#define USB_INT_CX_COMABORT    (1ULL << USB_SUB_GRP0_INT_CX_COMABORT)
#define USB_INT_F0_OUT         (1ULL << USB_SUB_GRP1_INT_F0_OUT)
#define USB_INT_F0_SPK         (1ULL << USB_SUB_GRP1_INT_F0_SPK)
#define USB_INT_F1_OUT         (1ULL << USB_SUB_GRP1_INT_F1_OUT)
#define USB_INT_F1_SPK         (1ULL << USB_SUB_GRP1_INT_F1_SPK)
#define USB_INT_F2_OUT         (1ULL << USB_SUB_GRP1_INT_F2_OUT)
#define USB_INT_F2_SPK         (1ULL << USB_SUB_GRP1_INT_F2_SPK)
#define USB_INT_F3_OUT         (1ULL << USB_SUB_GRP1_INT_F3_OUT)
#define USB_INT_F3_SPK         (1ULL << USB_SUB_GRP1_INT_F3_SPK)
#define USB_INT_F0_IN          (1ULL << USB_SUB_GRP1_INT_F0_IN)
#define USB_INT_F1_IN          (1ULL << USB_SUB_GRP1_INT_F1_IN)
#define USB_INT_F2_IN          (1ULL << USB_SUB_GRP1_INT_F2_IN)
#define USB_INT_F3_IN          (1ULL << USB_SUB_GRP1_INT_F3_IN)
#define USB_INT_RESET          (1ULL << USB_SUB_GRP2_INT_RESET)
#define USB_INT_SUSPEND        (1ULL << USB_SUB_GRP2_INT_SUSPEND)
#define USB_INT_RESUME         (1ULL << USB_SUB_GRP2_INT_RESUME)
#define USB_INT_TX0BYTE        (1ULL << USB_SUB_GRP2_INT_TX0BYTE)
#define USB_INT_RX0BYTE        (1ULL << USB_SUB_GRP2_INT_RX0BYTE)
#define USB_INT_DMA_CMPLT      (1ULL << USB_SUB_GRP2_INT_DMA_CMPLT)
#define USB_INT_DMA_ERROR      (1ULL << USB_SUB_GRP2_INT_DMA_ERROR)
#define USB_INT_IDLE           (1ULL << USB_SUB_GRP2_INT_IDLE)
#define USB_INT_WAKEUP_BY_VBUS (1ULL << USB_SUB_GRP2_INT_WAKEUP_BY_VBUS)
#define USB_INT_VDMA_CMPLT_CXF (1ULL << USB_SUB_GRP3_INT_VDMA_CMPLT_CXF)
#define USB_INT_VDMA_CMPLT_F0  (1ULL << USB_SUB_GRP3_INT_VDMA_CMPLT_F0)
#define USB_INT_VDMA_CMPLT_F1  (1ULL << USB_SUB_GRP3_INT_VDMA_CMPLT_F1)
#define USB_INT_VDMA_CMPLT_F2  (1ULL << USB_SUB_GRP3_INT_VDMA_CMPLT_F2)
#define USB_INT_VDMA_CMPLT_F3  (1ULL << USB_SUB_GRP3_INT_VDMA_CMPLT_F3)
#define USB_INT_VDMA_ERROR_CXF (1ULL << USB_SUB_GRP3_INT_VDMA_ERROR_CXF)
#define USB_INT_VDMA_ERROR_F0  (1ULL << USB_SUB_GRP3_INT_VDMA_ERROR_F0)
#define USB_INT_VDMA_ERROR_F1  (1ULL << USB_SUB_GRP3_INT_VDMA_ERROR_F1)
#define USB_INT_VDMA_ERROR_F2  (1ULL << USB_SUB_GRP3_INT_VDMA_ERROR_F2)
#define USB_INT_VDMA_ERROR_F3  (1ULL << USB_SUB_GRP3_INT_VDMA_ERROR_F3)
#define USB_INT_L1             (1ULL << USB_SUB_GRP4_INT_L1)

#define USB_SUB_GROUP_0_CX_SETUP_BIT_MUSK       (0x00000001)
#define USB_SUB_GROUP_0_CX_IN_BIT_MUSK          (0x00000002)
#define USB_SUB_GROUP_0_CX_OUT_BIT_MUSK         (0x00000004)
#define USB_SUB_GROUP_0_CX_COMFAIL_BIT_MUSK     (0x00000010)
#define USB_SUB_GROUP_0_CX_COMABORT_BIT_MUSK    (0x00000020)
#define USB_SUB_GROUP_1_F0_OUT_BIT_MUSK         (0x00000001)
#define USB_SUB_GROUP_1_F0_SPK_BIT_MUSK         (0x00000002)
#define USB_SUB_GROUP_1_F1_OUT_BIT_MUSK         (0x00000004)
#define USB_SUB_GROUP_1_F1_SPK_BIT_MUSK         (0x00000008)
#define USB_SUB_GROUP_1_F2_OUT_BIT_MUSK         (0x00000010)
#define USB_SUB_GROUP_1_F2_SPK_BIT_MUSK         (0x00000020)
#define USB_SUB_GROUP_1_F3_OUT_BIT_MUSK         (0x00000040)
#define USB_SUB_GROUP_1_F3_SPK_BIT_MUSK         (0x00000080)
#define USB_SUB_GROUP_1_F0_IN_BIT_MUSK          (0x00010000)
#define USB_SUB_GROUP_1_F1_IN_BIT_MUSK          (0x00020000)
#define USB_SUB_GROUP_1_F2_IN_BIT_MUSK          (0x00040000)
#define USB_SUB_GROUP_1_F3_IN_BIT_MUSK          (0x00080000)
#define USB_SUB_GROUP_2_RESET_BIT_MUSK          (0x00000001)
#define USB_SUB_GROUP_2_SUSPEND_BIT_MUSK        (0x00000002)
#define USB_SUB_GROUP_2_RESUME_BIT_MUSK         (0x00000004)
#define USB_SUB_GROUP_2_TX0BYTE_BIT_MUSK        (0x00000020)
#define USB_SUB_GROUP_2_RX0BYTE_BIT_MUSK        (0x00000040)
#define USB_SUB_GROUP_2_CMPLT_BIT_MUSK          (0x00000080)
#define USB_SUB_GROUP_2_ERROR_BIT_MUSK          (0x00000100)
#define USB_SUB_GROUP_2_IDLE_BIT_MUSK           (0x00000200)
#define USB_SUB_GROUP_2_WAKEUP_BY_VBUS_BIT_MUSK (0x00000400)
#define USB_SUB_GROUP_3_VDMA_CMPLT_CXF_BIT_MUSK (0x00000001)
#define USB_SUB_GROUP_3_VDMA_CMPLT_F0_BIT_MUSK  (0x00000002)
#define USB_SUB_GROUP_3_VDMA_CMPLT_F1_BIT_MUSK  (0x00000004)
#define USB_SUB_GROUP_3_VDMA_CMPLT_F2_BIT_MUSK  (0x00000008)
#define USB_SUB_GROUP_3_VDMA_CMPLT_F3_BIT_MUSK  (0x00000010)
#define USB_SUB_GROUP_3_VDMA_ERROR_CXF_BIT_MUSK (0x00010000)
#define USB_SUB_GROUP_3_VDMA_ERROR_F0_BIT_MUSK  (0x00020000)
#define USB_SUB_GROUP_3_VDMA_ERROR_F1_BIT_MUSK  (0x00040000)
#define USB_SUB_GROUP_3_VDMA_ERROR_F2_BIT_MUSK  (0x00080000)
#define USB_SUB_GROUP_3_VDMA_ERROR_F3_BIT_MUSK  (0x00100000)
#define USB_SUB_GROUP_4_L1_BIT_MUSK             (0x00000001)

/*@} end of group USB_Public_Macros */

/** @defgroup  USB_Public_Functions
 *  @{
 */

/**
 *  @brief USB Functions
 */
BL_Err_Type USB_Set_Normal_Config(USB_NORMAL_Cfg_Type *cfg);
BL_Err_Type USB_SOF_Mask_Time_HighSpeed(void);
BL_Err_Type USB_SOF_Mask_Time_FullSpeed(void);
BL_Err_Type USB_SoftDetach_Enable(void);
BL_Err_Type USB_SoftDetach_Disable(void);
USB_DEVICE_SPEED_Type USB_Get_Device_Speed_Status(void);
BL_Err_Type USB_Go_Suspend(uint8_t enable);
BL_Err_Type USB_Set_Device_Address(uint8_t addr);
uint8_t USB_Get_Device_Address(void);
BL_Err_Type USB_Non_Ctrl_Transfer_Enable(void);
BL_Err_Type USB_Non_Ctrl_Transfer_Disable(void);
BL_Err_Type USB_Clear_CTRL_FIFO(void);
BL_Sts_Type USB_Is_CTRL_FIFO_Empty(void);
BL_Sts_Type USB_Is_CTRL_FIFO_Full(void);
BL_Err_Type USB_Clear_FIFO(void);
BL_Err_Type USB_Reset_FIFO(USB_FIFO_Type fifoID);
BL_Sts_Type USB_Is_FIFO_Empty(USB_FIFO_EMPTY_Type fifoNum);
BL_Err_Type USB_Set_FIFO_Of_Endpoint_IN(USB_Endpoint_Type epID, USB_FIFO_Type fifoID);
BL_Err_Type USB_Set_FIFO_Of_Endpoint_OUT(USB_Endpoint_Type epID, USB_FIFO_Type fifoID);
BL_Err_Type USB_Set_FIFO_Config(USB_FIFO_Type fifoID, USB_FIFO_Cfg_Type *cfg);
uint16_t USB_Get_OUT_FIFO_Count(USB_FIFO_Type fifoID);
BL_Err_Type USB_Set_Endpoint_IN_MaxPacketSize(USB_Endpoint_Type epID, uint16_t max);
BL_Err_Type USB_Set_Endpoint_OUT_MaxPacketSize(USB_Endpoint_Type epID, uint16_t max);
BL_Err_Type USB_Set_CTRL_Endpoint_Stall_Once(void);
BL_Err_Type USB_Set_Endpoint_IN_Stall(USB_Endpoint_Type epID, uint8_t enable);
BL_Err_Type USB_Set_Endpoint_OUT_Stall(USB_Endpoint_Type epID, uint8_t enable);
BL_Err_Type USB_CTRL_Endpoint_Data_Transfer_Done(void);
BL_Sts_Type USB_Is_Endpoint_Receive_Zero_Length_Packet(USB_Endpoint_Type epID);
BL_Err_Type USB_Clear_Endpoint_Receive_Zero_Length_Packet_Status(USB_Endpoint_Type epID);
BL_Err_Type USB_Reset_Endpoint_IN_Data_Toggle_Sequence(USB_Endpoint_Type epID);
BL_Err_Type USB_Reset_Endpoint_OUT_Data_Toggle_Sequence(USB_Endpoint_Type epID);
BL_Err_Type USB_Endpoint_Transmit_Zero_Length_Packet(USB_Endpoint_Type epID);
BL_Sts_Type USB_Is_Endpoint_Transfer_Zero_Length_Packet(USB_Endpoint_Type epID);
BL_Err_Type USB_Clear_Endpoint_Transfer_Zero_Length_Packet_Status(USB_Endpoint_Type epID);
BL_Err_Type USB_Get_Setup_Command(uint32_t setup[2]);
void USB_Reset_DMA_Accessing_Fifo(void);
BL_Err_Type USB_Update_DMA_Trans(uint32_t memAddr, uint32_t length);
BL_Err_Type USB_Set_DMA_Config(USB_DMA_TARGET_FIFO_Type fifoN, USB_DMA_Cfg_Type *cfg);
BL_Err_Type USB_Set_DMA_Start(void);
BL_Err_Type USB_Set_VDMA_Config(USB_VDMA_TARGET_FIFO_Type fifoN, USB_VDMA_Cfg_Type *cfg);
BL_Err_Type USB_Set_VDMA_Start(USB_VDMA_TARGET_FIFO_Type fifoN);
BL_Sts_Type USB_Get_VDMA_Start(USB_VDMA_TARGET_FIFO_Type fifoN);
BL_Err_Type USB_Set_VDMA_Enable(void);
BL_Err_Type USB_Set_LPM_Config(USB_LPM_Cfg_Type *cfg);
uint8_t USB_Get_LPM_BESL(void);
/*----------*/
BL_Err_Type USB_Set_Suspend_Delay(uint8_t ms);
/*----------*/
BL_Err_Type USB_Global_IntEnable(uint8_t enable);
BL_Err_Type USB_Global_IntMask(USB_GLOBAL_INT_Type intType, BL_Mask_Type intMask);
BL_Sts_Type USB_Global_IntStatus(USB_GLOBAL_INT_Type intType);
/*----------*/
BL_Err_Type USB_Group_IntMask(USB_GRP_INT_Type intType, BL_Mask_Type intMask);
BL_Sts_Type USB_Group_IntStatus(USB_GRP_INT_Type intType);
/*----------*/
BL_Err_Type USB_Sub_Group_IntMask(uint64_t intType);
BL_Err_Type USB_Sub_Group_IntUnmask(uint64_t intType);
/*----------*/
uint32_t USB_Get_Sub_Group_0_IntStatus(void);
uint32_t USB_Get_Sub_Group_1_IntStatus(void);
uint32_t USB_Get_Sub_Group_2_IntStatus(void);
uint32_t USB_Get_Sub_Group_3_IntStatus(void);
uint32_t USB_Get_Sub_Group_4_IntStatus(void);
uint32_t USB_Get_Sub_Group_0_IntMask(void);
uint32_t USB_Get_Sub_Group_1_IntMask(void);
uint32_t USB_Get_Sub_Group_2_IntMask(void);
uint32_t USB_Get_Sub_Group_3_IntMask(void);
uint32_t USB_Get_Sub_Group_4_IntMask(void);
BL_Err_Type USB_Get_Sub_Group_0_IntClear(uint32_t clrVal);
BL_Err_Type USB_Get_Sub_Group_1_IntClear(uint32_t clrVal);
BL_Err_Type USB_Get_Sub_Group_2_IntClear(uint32_t clrVal);
BL_Err_Type USB_Get_Sub_Group_3_IntClear(uint32_t clrVal);
BL_Err_Type USB_Get_Sub_Group_4_IntClear(uint32_t clrVal);
/*----------*/;

/*@} end of group USB_Public_Functions */

/*@} end of group USB */

/*@} end of group BL808_Peripheral_Driver */

#endif /* __BL808_USB_H__ */
